templates = {
    "يعالج": [
        r"يستخدم\s+(\S+)\s+في\s+علاج\s+(\S+)",
        r"يعالج\s+(\S+)\s+مرض\s+(\S+)",
        r"يشفي\s+(\S+)\s+من\s+(\S+)",
        r"يداوي\s+(\S+)\s+حالة\s+(\S+)",
        r"يُعالج\s+(\S+)\s+الإصابة\s+بـ\s+(\S+)",
        r"(\S+)\s+دواء\s+لـ\s+(\S+)",
        r"(\S+)\s+علاج\s+فعال\s+لـ\s+(\S+)",
        r"(\S+)\s+من\s+أدوية\s+(\S+)",
        r"علاج\s+(\S+)\s+يكون\s+بـ\s+(\S+)",
        r"(\S+)\s+فعال\s+ضد\s+(\S+)",
        r"(\S+)\s+ناجع\s+في\s+معالجة\s+(\S+)",
        r"(\S+)\s+مفيد\s+لمرضى\s+(\S+)",
        r"باستخدام\s+(\S+)\s+يمكن\s+الشفاء\s+من\s+(\S+)",
        r"بعد\s+تناول\s+(\S+)\s+تتحسن\s+حالة\s+(\S+)",
        r"يعطى\s+(\S+)\s+لمرضى\s+(\S+)",
        r"يُوصف\s+(\S+)\s+لحالات\s+(\S+)",
        r"إذا\s+كنت\s+تعاني\s+من\s+(\S+)\s+فاستخدم\s+(\S+)",
        r"لمرضى\s+(\S+)\s+ينصح\s+بـ\s+(\S+)",
        r"لعلاج\s+(\S+)\s+يستخدم\s+(\S+)",
        r"في\s+حالات\s+(\S+)\s+يوصى\s+بـ\s+(\S+)"
    ],
    
    "يتسبب": [
        r"يؤدي\s+(\S+)\s+إلى\s+(\S+)",
        r"يتسبب\s+(\S+)\s+في\s+(\S+)",
        r"(\S+)\s+يؤدي\s+إلى\s+حدوث\s+(\S+)",
        r"من\s+آثار\s+(\S+)\s+الإصابة\s+بـ\s+(\S+)",
        r"يُحدث\s+(\S+)\s+مرض\s+(\S+)"
    ],
    
    "يقي": [
        r"يقي\s+(\S+)\s+من\s+(\S+)",
        r"يحمي\s+(\S+)\s+من\s+الإصابة\s+بـ\s+(\S+)",
        r"يمنع\s+(\S+)\s+حدوث\s+(\S+)",
        r"يُحصن\s+(\S+)\s+ضد\s+(\S+)",
        r"يقي\s+(\S+)\s+من\s+خطر\s+(\S+)"
    ],
    
    "يزيد": [
        r"يزيد\s+(\S+)\s+من\s+(\S+)",
        r"يرفع\s+(\S+)\s+مستوى\s+(\S+)",
        r"يعزز\s+(\S+)\s+من\s+(\S+)",
        r"يُضاعف\s+(\S+)\s+خطر\s+(\S+)",
        r"يُكثف\s+(\S+)\s+من\s+(\S+)"
    ],
    
    "يقلل": [
        r"يقلل\s+(\S+)\s+من\s+(\S+)",
        r"يخفض\s+(\S+)\s+مستوى\s+(\S+)",
        r"يحد\s+(\S+)\s+من\s+(\S+)",
        r"يُضعف\s+(\S+)\s+(\S+)",
        r"يُخمد\s+(\S+)\s+(\S+)"
    ]
}